app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"  WHERE "comments"."question_id" = 1
---
  def index
    comments = Comment.where(question_id: params[:question_id])

INSERT INTO "comments" ("author", "created_at", "question_id", "text", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author", "Jared"], ["created_at", "2015-08-05 05:40:16.086319"], ["question_id", 1], ["text", "With my SO"], ["updated_at", "2015-08-05 05:40:16.086319"]]
SELECT  "comments".* FROM "comments"   ORDER BY "comments"."id" DESC LIMIT 10
---
  def create
    @comment = Comment.new(comment_params)
    @comment.save

    if request.xhr?
      render :json => Comment.last(10)