app/controllers/questions_controller.rb

  def show
    # questions = Question.all
    # render :json questions
    render json: Question.all
---
SELECT "questions".* FROM "questions"