app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"
---
  def index
    # questions = Question.all
    # render :json questions
    render json: Question.all