app/controllers/single_page_app_controller.rb

SELECT "questions".* FROM "questions"
---
  def show
    questions = Question.all